In [1]:
import pandas as pd
import numpy as np
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
from sqlalchemy.types import *

In [2]:
#Let's import our data

title_basics = pd.read_csv('Data/title_basics.csv.gz')
title_ratings = pd.read_csv('Data/title_ratings.csv.gz')
tmdb_data = pd.read_csv('Data/tmdb_results_combined.csv.gz')

In [3]:
#First let's start by focusing on title_basics
title_basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama

In [4]:
#First, let's create a new table for our genres with each unique value that can occur in that column

#Convert string into list in new column
title_basics['genres_split'] = title_basics['genres'].str.split(',')
title_basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama,[Drama]
...,...,...,...,...,...,...,...,...,...,...
82471,tt9914942,movie,Life Without Sara Amat,La vida sense la Sara Amat,0,2019,NaN,74,Drama,[Drama]
82472,tt9915872,movie,The Last White Witch,My Girlfriend is a Wizard,0,2019,NaN,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
82473,tt9916170,movie,The Rehearsal,O Ensaio,0,2019,NaN,51,Drama,[Drama]
82474,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
82475,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History","[Drama, History]"

In [5]:
#Now we can explode our new column in a new dataframe, and pull only the unique values minus any nulls, and sort alphabetically
exploded_genres = title_basics.explode('genres_split')

unique_genres = sorted(exploded_genres['genres_split'].dropna().unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [6]:
#Now let's create a new table, consisting of just our 'tconst' column and our genres_split

title_genres = exploded_genres[['tconst','genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [7]:
#Now we will create a lookup dictionary for our genres, by assigning an index value to each one

genre_index = range(len(unique_genres))
genre_lookup = dict(zip(unique_genres, genre_index))
genre_lookup

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [8]:
#Now we can go back and map our genre ids onto our title_genre dataframe using our genre_lookup table! 

title_genres['Genre_Id'] = title_genres['genres_split'].map(genre_lookup)
title_genres

          tconst genres_split  Genre_Id
0      tt0035423       Comedy         5
0      tt0035423      Fantasy         9
0      tt0035423      Romance        18
1      tt0062336        Drama         7
2      tt0069049        Drama         7
...          ...          ...       ...
82474  tt9916190       Action         0
82474  tt9916190    Adventure         2
82474  tt9916190     Thriller        23
82475  tt9916362        Drama         7
82475  tt9916362      History        11

[154160 rows x 3 columns]

In [9]:
#Let's drop our redundant genres_split column now and reset our index
title_genres = title_genres.drop(columns='genres_split')
title_genres = title_genres.reset_index()
title_genres.head()

   index     tconst  Genre_Id
0      0  tt0035423         5
1      0  tt0035423         9
2      0  tt0035423        18
3      1  tt0062336         7
4      2  tt0069049         7

In [10]:
#We can get rid of the old index column now
title_genres = title_genres.drop(columns='index')
title_genres.head()

      tconst  Genre_Id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

In [11]:
#Let's convert our genre lookup dictionary into a dataframe
genre_lookup = pd.DataFrame({'Genre_Name':genre_lookup.keys(), 'Genre_ID':genre_lookup.values()})
genre_lookup.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [12]:
#Now that we have both of our Genre tables created, lets go back and clean-up our original basics dataframe

title_basics = title_basics.drop(columns=['originalTitle', 'isAdult', 'titleType', 'genres', 'genres_split'])

title_basics.head()

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,NaN,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,NaN,70
2,tt0069049,The Other Side of the Wind,2018,NaN,122
3,tt0088751,The Naked Monster,2005,NaN,100
4,tt0096056,Crime and Punishment,2002,NaN,126

In [13]:
#Let's make it look a little nicer

title_basics = title_basics.rename(columns={"primaryTitle":"Title", "startYear":"Start_Year", "endYear":"End_Year", "runtimeMinutes":"Runtime_Mins"})
title_basics.head()

,tconst,Title,Start_Year,End_Year,Runtime_Mins
0,tt0035423,Kate & Leopold,2001,NaN,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,NaN,70
2,tt0069049,The Other Side of the Wind,2018,NaN,122
3,tt0088751,The Naked Monster,2005,NaN,100
4,tt0096056,Crime and Punishment,2002,NaN,126

In [14]:
#Let's take a quick look at our title_ratings table now

title_ratings.head()

      tconst  averageRating  numVotes
0  tt0035423            6.4     84685
1  tt0062336            6.4       161
2  tt0069049            6.7      7359
3  tt0088751            5.2       325
4  tt0096056            5.6       821

In [15]:
#Again, let's make it look a little nicer

title_ratings = title_ratings.rename(columns={"averageRating":"Avg_Rating", "numVotes":"Total_Votes"})
title_ratings.head()

      tconst  Avg_Rating  Total_Votes
0  tt0035423         6.4        84685
1  tt0062336         6.4          161
2  tt0069049         6.7         7359
3  tt0088751         5.2          325
4  tt0096056         5.6          821

In [16]:
#Finally let's take a look at our last table, our TMDB API results

tmdb_data.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.500,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.100,8.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,0.000,0.0,NaN
4,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",http://www.wkw-inthemoodforlove.com/,843.0,cn,花樣年華,...,12854953.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.111,1979.0,PG

In [17]:
#Our client only requires id, revenue, budget and certification for our database, so let's create that

tmdb_data = tmdb_data[['imdb_id', 'revenue','budget','certification']]

tmdb_data.head()

     imdb_id     revenue      budget certification
0          0         NaN         NaN           NaN
1  tt0113026         0.0  10000000.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0118694  12854953.0    150000.0            PG

In [18]:
#To keep our schema consistent, let's change imdb_id over to tconst

tmdb_data = tmdb_data.rename(columns={"imdb_id":"tconst"})
tmdb_data.head()

      tconst     revenue      budget certification
0          0         NaN         NaN           NaN
1  tt0113026         0.0  10000000.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0118694  12854953.0    150000.0            PG

In [19]:
#It appears we are ready to create our SQL database! 

#Let's create our connection & engine

connection = "mysql+pymysql://root:root@localhost/movies"

engine = create_engine(connection)

In [20]:
#Now we can create our database and verify it was created

#create_database(connection)

database_exists(connection)

True

In [22]:
#Now we can start adding tables into our SQL database
#For our basics table, our primary key will be the tconst id from IMDB, since this is a string we will need to tell SQL that

key_len = title_basics['tconst'].fillna('').map(len).max()
title_len = title_basics['Title'].fillna('').map(len).max()

schema = {"tconst":String(key_len+1), "Title":Text(title_len+1), "Start_Year":Float(), "End_Year":Float(), "Runtime_Mins":Integer()}

title_basics.to_sql('title_basics', engine, dtype=schema, if_exists='replace', index=False)

82476

In [25]:
#Now we can add tconst as our primary key

engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [26]:
#Now let's add in our title_ratings table

title_ratings.to_sql('title_ratings', engine, if_exists = 'replace')

67739

In [27]:
#Now our genre lookup table

genre_lookup.to_sql('genres', engine, if_exists = 'replace')

26

In [28]:
#Now our title genres table

title_genres.to_sql('title_genres', engine, if_exists = 'replace')

154160

In [29]:
#And finally our tmdb data table

tmdb_data.to_sql('tmdb_data', engine, if_exists = 'replace')

2498

In [30]:
#Let's verify all of our tables went through

pd.read_sql("""SHOW TABLES;""", engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data

In [ ]:
#Let's create an ERD and add it

![png](Data/Movies_ERD.png)

In [31]:
#Finally, let's call the first five rows from each of our tables with a SQL Query

q = """SELECT *
FROM title_basics
LIMIT 5"""

pd.read_sql(q, engine)

,tconst,Title,Start_Year,End_Year,Runtime_Mins
0,tt0035423,Kate & Leopold,2001.0,None,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,None,70
2,tt0069049,The Other Side of the Wind,2018.0,None,122
3,tt0088751,The Naked Monster,2005.0,None,100
4,tt0096056,Crime and Punishment,2002.0,None,126

In [32]:
q = """SELECT *
FROM title_ratings
LIMIT 5"""

pd.read_sql(q, engine)

   index     tconst  Avg_Rating  Total_Votes
0      0  tt0035423         6.4        84685
1      1  tt0062336         6.4          161
2      2  tt0069049         6.7         7359
3      3  tt0088751         5.2          325
4      4  tt0096056         5.6          821

In [33]:
q = """SELECT *
FROM tmdb_data
LIMIT 5"""

pd.read_sql(q, engine)

   index     tconst     revenue      budget certification
0      0          0         NaN         NaN          None
1      1  tt0113026         0.0  10000000.0          None
2      2  tt0113092         0.0         0.0          None
3      3  tt0116391         0.0         0.0          None
4      4  tt0118694  12854953.0    150000.0            PG

In [34]:
q = """SELECT *
FROM title_genres
LIMIT 5"""

pd.read_sql(q, engine)

   index     tconst  Genre_Id
0      0  tt0035423         5
1      1  tt0035423         9
2      2  tt0035423        18
3      3  tt0062336         7
4      4  tt0069049         7

In [35]:
q = """SELECT *
FROM genres
LIMIT 5"""

pd.read_sql(q, engine)

   index Genre_Name  Genre_ID
0      0     Action         0
1      1      Adult         1
2      2  Adventure         2
3      3  Animation         3
4      4  Biography         4